

-- INSERT INTO Department(DepartmentId, DepartmentName)
-- VALUES(1, 'พนักงานขับรถ')



-- INSERT INTO Employees (EmployeeId, EmployeeNo, FirstName, LastName, Gender, DepartmentId, Salary, Tel)
-- VALUES (1,'00000001','นายวิเชียร', 'ผลบุญ', 'M', 1, 10000, '0900000001'),
-- (2,'00000002','นายสุรพล', 'แย้มทองหลาม', 'M', 1, 10000, '0900000002'),
-- (3,'00000003','นายไพฑูร', 'พระเสมา', 'M', 1, 10000, '0900000003'),
-- (4,'00000004','นายโควิน', 'ทะเจริญ', 'M', 1, 12000, '0900000004'),
-- (5,'00000005','นายคมสัน', 'พิรักษา', 'M', 1, 10300, '0900000005'),
-- (6,'00000006','นายบัวผัน', 'กิ่งนอก', 'M', 1, 12300, '0900000006'),
-- (7,'00000007','นายวันเพ็ญ', 'ปันรัมย์', 'M', 1, 11000, '0900000007'),
-- (8,'00000008','นายบุญสิน', 'แก้วพันธ์', 'M', 1, 11000, '0900000008'),
-- (9,'00000009','นายสมชาย', 'เย็นใจ', 'M', 1, 10200, '0900000009'),
-- (10,'00000010','นายสมเด็จ', 'พรมธิ', 'M', 1, 10230, '0900000010')

-- INSERT INTO Brand(BrandId, BrandName)
-- VALUES (1, 'ช้าง'),(2,'นิยมไทย'),(3, 'รวงข้าว'),(4,'หงส์ทอง'),
--         (5, 'แสงโสม'), (6, 'โออิชิ')


-- INSERT INTO District(DistrictId, DistrictName)
-- VALUES  ('01', 'เมืองนครราชสีมา'),
--         ('02', 'ครบุรี'),
--         ('03','เสิงสาง'),
--         ('04', 'คง')

-- INSERT INTO SubDistrict(SubDistrictId, SubDistrictName)
-- VALUES ('01', 'ในเมือง'),('02', 'โพธิ์กลาง'),('03','หนองจะบก'),('04','โคกสูง'),
--         ('05', 'มะเริง'), ('06', 'หนองระเวียง'), ('07', 'ปรุใหญ่'),('08', 'หมื่นไวย'),
--         ('09', 'พลกรัง'), ('10', 'หนองไผ่ล้อม'), ('11', 'หัวทะเล'),('12','บ้านเกาะ'),
--         ('13', 'บ้านใหม่'),('14','พุดซา'),('15', 'บ้านโพธิ์'),('16', 'จอหอ'),('17', 'โคกกรวด'),
--         ('18', 'ไชยมงคล'), ('19', 'หนองบัวศาลา'),('20','สุรนารี'),('21', 'สีมุม'),
--         ('22', 'ตลาด'), ('23', 'พะเนา'), ('24', 'หนองกระทุ่ม'), ('25','หนองไข่น้ำ')

-- SELECT * FROM CustomerType
-- SELECT * FROM Province
--  INSERT INTO Customer (CustomerID, CustomerNo, CustomerName, CustomerTypeId, ProvinceId, Tel)
--  VALUES (1,'00000000000000000001', 'บิ๊กซี ซูเปอร์เซ็นเตอร์ (สาขาที่ 8 นครราชสีมา)',1,'30', '0980000001'),
--  (2,'00000000000000000002', 'บจก.เค.เอ็น.จี(โกดังเค.เอ็น.จี)',2,'30', '0980000002'),
--  (3,'00000000000000000003', 'หจก.เสรีวัฒน์ การสุรา (โกดัง)',2,'30', '0980000003'),
--  (4,'00000000000000000004', 'บจก.วงศ์มังกร ซุปเปอร์สโตร์ ',2,'30', '0980000004'),
--  (5,'00000000000000000005', 'บิ๊กซี ซูเปอร์เซ็นเตอร์ สาขาโนนสูง)',1,'30', '0980000005'),
--  (6,'00000000000000000006', 'นางแอ๋ว กษมาดิลก',2,'30', '0980000006'),
--  (7,'00000000000000000007', 'ฟู้ดแพชชั่น',2,'30', '0980000007'),
--  (8,'00000000000000000008', 'เอ็มเค เรสโตรองต์ กรุ๊ป',2,'30', '0980000008'),
--  (9,'00000000000000000009', 'เฉลียวมาร์เก็ต',2,'30', '09800000009'),
--  (10,'00000000000000000010', 'บจก.สยามวิชโก้',2,'30', '0980000010')

-- SELECT * FROM Customer
-- SELECT * FROM District
-- SELECT * FROM SubDistrict
-- SELECT * FROM Province

-- INSERT INTO CustomerLocation(CustomerLocationId, CustomerId, CustomerLocationName, [No], Moo, Soi, Street,SubDistrictId, DistrictId, ProvinceId,Postal,Tel)
-- VALUES (1, 1, 'บิ๊กซี ซูเปอร์เซ็นเตอร์ (สาขาที่ 8 นครราชสีมา)', '118', '1', null, 'ถนนมิตรภาพ' , '01', '01','30', '30000', '0980821425'),
-- (2, 2, 'บจก.เค.เอ็น.จี ( หน้าบ้าน)', '254/1', '3', null, 'ถนนมหาดไทย' , '01', '01','30', '30000', '0900000002'),
-- (3, 3, 'หจก.เสรีวัฒน์ การสุรา', '45/7', '1', 'ซอยวัดม่วง', 'ถนนสุรนารี' , '01', '01','30', '30000', '0980821499'),
-- (4, 4, 'วงศ์มังกร ซุปเปอร์สโตร์ (หนองบัวศาลา)', '158', '3', null, 'ถนนราชสีมา-โชคชัย' , '19', '01','30', '30000', '0980824585'),
-- (5, 5, 'บิ๊กซี ซูเปอร์เซ็นเตอร์ สาขาโนนสูง', '98', '1', null, 'ถนนโนนสูง' , '04', '01','30', '30000', '0980847825')


-- INSERT INTO SKUType(SKUTypeId, SKUTypeName)
-- VALUES(1, 'ขวด'),(2,'กระป๋อง')


SELECT * FROM SKUType